{
    "basics": {
        "name": "Catherine Kim",
        "description": "Software Engineer | Web Development Javascript Ruby Rails React Redux Git Express.js Node.js PostgreSQL MongoDB AWS CSS/SCSS HTML",
        "image": "",
        "email": "catkimyj@gmail.com",
        "phone": "(929)-399-6005",
        "jobStatus": "open to work",
        "url": "http://catherinekim.me/",
        "summary": "I am a designer turned software engineer who believes that exquisite code not only outputs a product that is user-friendly, comprehensive, and functional, such values are held within the visual aspects of the lines of code, as well. I am adaptable, open-minded, and value all learning experiences. With prior managerial skills with past employers, I am always a team player and believe in rising up together rather than holding a win-lose mindset. ",
        "location": {
            "address": "New York City",
            "postalCode": "",
            "city": "New York",
            "countryCode": "US"
        },
        "profiles": [
            {
                "network": "LinkedIn",
                "username": "catherinekimyj",
                "url": "https://www.linkedin.com/in/catherinekimyj/"
            },
            {
                "network": "AngelList",
                "username": "catherinekimyj",
                "url": "https://www.angel.co/u/catherinekimyj/"
            }
        ]
    },
    "work": [
        {
            "name": "Forsythia Studio",
            "endDate": "December 2019",
            "highlights": [],
            "position": "Founder",
            "startDate": "August 2017",
            "summary": "Shifting the way we consume and contribute to fashion, Forsythia was built on the foundation of producing clothing through environmentally and socially conscious processes. As the founder and designer of the sustainable luxury brand, I worked closely with showrooms and PR agencies, and managed contractors and freelancers. I also managed and modified the code for the company website. Forsythia has been featured in: Vogue China, Latest magazine, Revs magazine, Shuba magazine, Schon magazine, ONE magazine, and numerous others.",
            "url": ""
        },
        {
            "name": "Marchesa",
            "endDate": "November 2020",
            "highlights": [],
            "position": "First Creative Patternmaker",
            "startDate": "November 2019",
            "summary": "I drafted patterns for 10+ garments per season for six collections per year, and supervised the process and execution. Technical fit and errors were analyzed and discussed each season. I shared the task in managing a team of 6+ sewers and interns, and mentored the junior pattern maker in coaching technical and non-technical skills in the atelier.",
            "url": ""
        },
        {
            "name": "Christian Siriano",
            "endDate": "March 2017",
            "highlights": [],
            "position": "Assistant Designer",
            "startDate": "December 2014",
            "summary": "Working closely with founder Christian Siriano, I assisted in design execution and patterned garments for five collections per year, each collection consisting of an average of 50 looks. I drafted patterns of custom garments for private clients and celebrities, managed sewers and interns, and communicated with the production team for efficient garment production.",
            "url": ""
        },
        {
            "name": "Christian Siriano",
            "endDate": "July 2014",
            "highlights": [],
            "position": "Freelance Designer",
            "startDate": "February 2013",
            "url": ""
        },
        {
            "name": "Badgley Mischka",
            "endDate": "February 2013",
            "highlights": [],
            "position": "Design Intern",
            "startDate": "September 2012",
            "url": ""
        },
        {
            "name": "Anna Sui",
            "endDate": "December 2010",
            "highlights": [],
            "position": "Design Intern",
            "startDate": "September 2010",
            "url": ""
        }
    ],
    "volunteer": [
        {
            "organization": "A Million Masks",
            "position": "Fundraising Volunteer",
            "url": "https://www.linkedin.com/company/65282278",
            "startDate": "2020-03-31",
            "endDate": "2020-03-31",
            "summary": "A Million Masks is a nonprofit organization whose mission is to secure emergency Personal Protective Equipment (PPE) for frontline hospital workers in New York City. My role as a volunteer was to reach out to high-profile individuals to explain the mission and goal of A Million Masks and to invite them to share our GoFundMe link on social media platforms and help spread the word. The highest number of exposure per individual was brought in by clothing designer Phillip Lim, who shared AMM's story on both his brand and personal social media platforms.",
            "highlights": []
        }
    ],
    "education": [
        {
            "institution": "App Academy",
            "area": "Computer Software Engineering",
            "studyType": "",
            "startDate": "2020-03-16",
            "endDate": "2020-07-03",
            "gpa": "",
            "courses": []
        },
        {
            "institution": "Fashion Institute of Technology",
            "area": "Fashion/Apparel Design",
            "studyType": "Bachelor of Fine Arts (BFA)",
            "startDate": "2009-12-31",
            "endDate": "2013-12-31",
            "gpa": "",
            "courses": []
        },
        {
            "institution": "James Madison University",
            "area": "Dietetics and Clinical Nutrition Services",
            "studyType": "",
            "startDate": "2007-12-31",
            "endDate": "2009-12-31",
            "gpa": "",
            "courses": []
        }
    ],
    "awards": [],
    "publications": [],
    "skills": [ 
        {
            "languages": 
                ["JavaScript", "Ruby"]
        },
        {
            "stack": [
                "Ruby on Rails", "React-Redux", "Express.js", "MongoDB", "Node.js", "SQL"
            ]
        },
        {
            "allSkills": [
                "JavaScript", "Ruby", "HTML5",  "Cascading Style Sheets (CSS)", "Git", "Amazon Web Services (AWS)", "Rails",
                "React", "Redux", "MongoDB", "Express.js", "Node.js", "SQL", "jQuery", "AJAX", "Google Maps API",    
                "Application Programming Interfaces", "Test Driven Development", "PostgreSQL", "Web Development", "Front-end Development",
                "Back-end Development",
                "Microsoft Word", "Microsoft Office", "PowerPoint", "Illustrator", "Lightroom",
                "Photoshop", "InDesign"
            ]
        },
        {
            "techSkills": [
                "JavaScript", "Ruby", "HTML5",  "Cascading Style Sheets (CSS)", "Git", "Amazon Web Services (AWS)", "Rails",
                "React", "Redux", "MongoDB", "Express.js", "Node.js", "SQL", "jQuery", "AJAX", "Google Maps API",    
                "Application Programming Interfaces", "Test Driven Development", "PostgreSQL", "Web Development", "Front-end Development",
                "Back-end Development"
            ]
        },
        {
            "miscSkills": [
                "Microsoft Word", "Microsoft Office", "PowerPoint", "Illustrator", "Lightroom",
                "Photoshop", "InDesign"
            ]
        }
    ],   
    "languages": [
        {
            "language": "English",
            "fluency": "Native speaker"
        },
        {
            "language": "Korean",
            "fluency": "Native speaker"
        }
    ],
    "interests": [],
    "references": [
        {
            "name": "Gloria Kang",
            "reference": "Catherine is determined and tenacious. Every project that we worked on was a project that was produced thoughtfully and thoroughly.\n\nCatherine served as the frontend lead for a MERN stack application that was built by a team of four engineers. Her deep and extensive knowledge of React and her ability to implement striking visual elements is what really helped to distinguish our app. Not only does she excel technically, but she is also a great communicator. She worked seamlessly with our backend lead and not only were our deadlines met, but everything was completed to the t.\n\nI have been inspired by Catherine multiple times to never give up. I've watched her work through tough bugs with such drive and witnessed her creative process from ideation to reality. I can confidently recommend Catherine as I know she will be asset to any organization."
        },
        {
            "name": "Mari Kasanuki",
            "reference": "Catherine's sense for eye-catching design and ability to weave that into code is truly exceptional.\n\nShe and I worked on several projects together during App Academy's intense curriculum, and I often witnessed her build impressive user interface and UX features that elevated the application. I always looked forward to her demos and was consistently thrilled by what she produced. When faced with frustrating bugs, Catherine wouldn't give up and showcased an ability to inspire us to keep going to find a resolution.\n\nShe is a talented and creative individual, who would absolutely be an asset to any team."
        },
        {
            "name": "Emina Ramovic",
            "reference": "Catherine was one of the students I absolutely enjoyed working with and stayed in touch after graduating. Collaborating with her on a project I kept getting more and more impressed with Catherine's eye for design until we worked on the back-end together. That is when I realized how diverse and technically skilled engineer Catherine is.\n\nI am absolutely confident that Catherine's skills and team spirit will make a big difference in any company. Not only will she bring the kind of knowledge and experiences you're looking for in an applicant, but she will also quickly become an asset and help your company grow in any way she can."
        }
    ],
    "projects": [
        {
            "name": "Profferly",
            "url": "http://profferly.herokuapp.com/"
        },
        {
            "name": "Wordplay",
            "url": "https://aa-wordplay.herokuapp.com/"
        },
        {
            "name": "Depth Perception",
            "url": "http://catherinekim.me/depth-perception/"
        }
    ]
}